(*
    Коментар на декілька рядків.
*)

// Однорядковий коментар

(*
    [<...>] - застосування атрибуту, аналог [...] з C#.
    Функція main завжди має бути останньою у останньому файлі у проєкті та має бути відмічена атрибутом EntryPoint
*)
[<EntryPoint>]
(*
    Прив'язка функції, що приймає параметр args - масив рядків та повертає число, до символу main
    В F# нам не потрібні модифікатори доступу (все всередині області відомості є публічним) та static
*)
let main (args:string[]) : int =
    // F# використовує відступи замість {} для створення областей видимості. Можна обрати ту кількість пробілів, яка подобається

    // printfn - нативна функція F# для виводу значень до консолі
    printfn "%A" args // ; на кінці рядків не потрібні

    (*
        Можна використовувати все, що є в базових бібліотеках .NET
        На початку файлу ми можемо додати інструкцію open System, щоб відкрити простір імен і писати просто Console.WriteLine
    *)
    System.Console.WriteLine "Hello World"

    (*
        Все є виразом та повертає значення
        Значення останнього виразу у функції використовується як значення всієї функції, окремий return не потрібен
    *)
    0
