(* Краще дивитися після: лекція 3 *)

(*
    Ми можемо визначати власні оператори у F#.
    Оператор визначається як звичайна функція, але її ім'я ми обов'язково беремо у дужки.
    Доступні символи для використання у операторах: !, $, %, &, *, +, -, ., /, <, =, >, ?, @, ^, |
*)

let (@) (x: int) (y: int) = x * x + y

(@) 5 10 |> printfn "%i"
(@) 10 5 |> printfn "%i"

// Якщо у оператора два параметри, компілятор дозволяє нам викликати його у інфіксній формі.
5 @ 10 |> printfn "%i"
10 @ 5 |> printfn "%i"

(*
    Якщо ми визначаємо унарний оператор і хочемо, щоб його можна було викликати без дужок, то
    на початку потрібно додати знак ~.
    При виклику без дужок його не потрібно вказувати, під час виклику з дужками - потрібно.
*)
let (~%) (x: int) = x = 0

(~%) 10 |> printfn "%b"
(~%) 0 |> printfn "%b"

%10 |> printfn "%b"
